#### Terraform fmt `success`, init `success`, plan `success`
<details><summary>Show Plan</summary>

```
terraform
ec_deployment.onweek_demo: Refreshing state... [id=b182e085c8da8da5f11de1a58a9d404e]
aws_lightsail_instance.onweek_windows_test: Refreshing state... [id=onweek_windows_test]
aws_lightsail_static_ip.onweek_windows_test_ip: Refreshing state... [id=onweek_windows_test_ip]
aws_lightsail_instance_public_ports.onweek_test: Refreshing state... [id=onweek_windows_test-2091683381]
aws_lightsail_static_ip_attachment.onweek_test: Refreshing state... [id=onweek_windows_test_ip]
elasticstack_auth_user.onweek_demo_user: Refreshing state... [id=onweek_demo_user]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_lightsail_instance.onweek_windows_test will be destroyed
  - resource "aws_lightsail_instance" "onweek_windows_test" {
      - arn                = "arn:aws:lightsail:us-east-1:216640295100:Instance/1f8ff505-badf-404c-ab61-493cb1b8f182" -> null
      - availability_zone  = "us-east-1a" -> null
      - blueprint_id       = "windows_server_2019" -> null
      - bundle_id          = "micro_win_2_0" -> null
      - cpu_count          = 1 -> null
      - created_at         = "2021-04-29T17:26:57Z" -> null
      - id                 = "onweek_windows_test" -> null
      - ipv6_address       = "2600:1f18:471e:9600:340d:7926:c9ef:5e2b" -> null
      - ipv6_addresses     = [
          - "2600:1f18:471e:9600:340d:7926:c9ef:5e2b",
        ] -> null
      - is_static_ip       = true -> null
      - key_pair_name      = "LightsailDefaultKeyPair" -> null
      - name               = "onweek_windows_test" -> null
      - private_ip_address = "172.26.9.253" -> null
      - public_ip_address  = "52.204.59.232" -> null
      - ram_size           = 1 -> null
      - tags               = {} -> null
      - user_data          = <<-EOT
            <powershell>
            $ProgressPreference = 'SilentlyContinue'
            Set-PSDebug -Trace 1
            Set-Location -Path "C:\Users\Administrator\Desktop"
            
            Invoke-WebRequest -Uri "https://artifacts.elastic.co/downloads/beats/elastic-agent/elastic-agent-7.12.1-windows-x86_64.zip" -OutFile "agent.zip"
            Expand-Archive -Path "agent.zip" -DestinationPath "C:\Users\Administrator\Desktop\agent"
            
            Start-Sleep -Seconds 10
            
            Add-MpPreference -ExclusionPath "C:\Users\Administrators\Desktop"
            Invoke-WebRequest -Uri "https://github.com/gentilkiwi/mimikatz/releases/download/2.2.0-20200918-fix/mimikatz_trunk.zip" -OutFile "mimikatz_trunk.zip"
            Expand-Archive -Path "mimikatz_trunk.zip" -DestinationPath "C:\Users\Administrator\Desktop\mimikatz"
            </powershell>
        EOT -> null
      - username           = "Administrator" -> null
    }

  # aws_lightsail_instance.onweek_windows_test_1 will be created
  + resource "aws_lightsail_instance" "onweek_windows_test_1" {
      + arn                = (known after apply)
      + availability_zone  = "us-east-1a"
      + blueprint_id       = "windows_server_2019"
      + bundle_id          = "micro_win_2_0"
      + cpu_count          = (known after apply)
      + created_at         = (known after apply)
      + id                 = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_addresses     = (known after apply)
      + is_static_ip       = (known after apply)
      + name               = "onweek_windows_test_1"
      + private_ip_address = (known after apply)
      + public_ip_address  = (known after apply)
      + ram_size           = (known after apply)
      + user_data          = (known after apply)
      + username           = (known after apply)
    }

  # aws_lightsail_instance_public_ports.onweek_test will be destroyed
  - resource "aws_lightsail_instance_public_ports" "onweek_test" {
      - id            = "onweek_windows_test-2091683381" -> null
      - instance_name = "onweek_windows_test" -> null

      - port_info {
          - cidrs     = [
              - "0.0.0.0/0",
            ] -> null
          - from_port = 3389 -> null
          - protocol  = "tcp" -> null
          - to_port   = 3389 -> null
        }
    }

  # aws_lightsail_static_ip.onweek_windows_test_ip will be destroyed
  - resource "aws_lightsail_static_ip" "onweek_windows_test_ip" {
      - arn          = "arn:aws:lightsail:us-east-1:216640295100:StaticIp/34cab75a-f7b5-4002-b8de-ca5e9f93d000" -> null
      - id           = "onweek_windows_test_ip" -> null
      - ip_address   = "52.204.59.232" -> null
      - name         = "onweek_windows_test_ip" -> null
      - support_code = "970872173501/52.204.59.232" -> null
    }

  # aws_lightsail_static_ip_attachment.onweek_test will be destroyed
  - resource "aws_lightsail_static_ip_attachment" "onweek_test" {
      - id             = "onweek_windows_test_ip" -> null
      - instance_name  = "onweek_windows_test" -> null
      - ip_address     = "52.204.59.232" -> null
      - static_ip_name = "onweek_windows_test_ip" -> null
    }

  # elasticstack_fleet_agent_policy.endpoint_1 will be created
  + resource "elasticstack_fleet_agent_policy" "endpoint_1" {
      + enrollment_secret = (sensitive value)
      + id                = (known after apply)
      + name              = "onweek-endpoint-1"
      + namespace         = "default"
    }

Plan: 2 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  - windows_ip = "52.204.59.232" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Pusher: @tsouza, Action: `pull_request`*